tap "1password/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "mrkai77/cask"
tap "nikitabobko/tap"
tap "zackelia/formulae"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Next-gen compiler infrastructure
brew "llvm"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Collection of portable C++ source libraries
brew "boost"
# Computational Geometry Algorithms Library
brew "cgal"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: :changed
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Lint your Python code for style and logical errors
brew "flake8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Postgres C API library
brew "libpq"
# GNOME XML library
brew "libxml2"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Python dependency management tool
brew "pipenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# C++ wrapper library around CGAL
brew "sfcgal"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Display management tool
cask "betterdisplay"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Downloads videos from different websites
cask "downie"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recorder and editor
cask "screen-studio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# JavaScript IDE
cask "webstorm"
# Video communication and virtual meeting platform
cask "zoom"
# Keyboard customiser
cask "karabiner-elements"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.quicktype-refresh"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "jannisx11.batch-rename-extension"
vscode "jock.svg"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "naumovs.color-highlight"
vscode "nmsmith89.incrementor"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "sdras.vue-vscode-snippets"
vscode "sleistner.vscode-fileutils"
vscode "techer.open-in-browser"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tonka3000.raycast"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
