tap "1password/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Modern replacement for 'ls'
brew "exa"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# GitHub command-line tool
brew "gh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Mac App Store command-line interface
brew "mas"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Messaging broker
brew "rabbitmq", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# CLI tool that moves files or folder to the trash
brew "trash"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@5.0"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Utility to hide menu bar items
cask "hiddenbar"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# App to manage software development and track bugs
cask "linear-linear"
# Email client
cask "readdle-spark"
# Team communication and collaboration software
cask "slack"
# Rust-based terminal
cask "warp"
# JavaScript IDE
cask "webstorm"

# New
cask "postman"
cask "hyperkey"
cask "cleanshot"
cask "screen-studio"
cask "google-chrome"
cask "arc"
cask "cleanmymac"
cask "telegram"
cask "iina"
cask "folx"
cask "downie"
cask "spotify"
cask "zoom"
cask "discord"
cask "openvpn-connect"
cask "hubstaff"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Boop", id: 1518425043
mas "Equinox", id: 1591510203
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onelight"
vscode "albert.TabOut"
vscode "ashinzekene.nestjs"
vscode "bierner.markdown-preview-github-styles"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "Codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.quicktype-refresh"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "Gruntfuggly.todo-tree"
vscode "JannisX11.batch-rename-extension"
vscode "jock.svg"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "naumovs.color-highlight"
vscode "nmsmith89.incrementor"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "sdras.vue-vscode-snippets"
vscode "sleistner.vscode-fileutils"
vscode "techer.open-in-browser"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
