tap "1password/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Mac App Store command-line interface
brew "mas"
# Manage multiple Node.js versions
brew "nvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI tool that moves files or folder to the trash
brew "trash"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# GPU-based terminal emulator
cask "kitty"
# App to manage software development and track bugs
cask "linear-linear"
# Email client
cask "readdle-spark"
# Team communication and collaboration software
cask "slack"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Boop", id: 1518425043
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
vscode "adpyke.codesnap"
vscode "albert.TabOut"
vscode "AlexShen.classdiagram-ts"
vscode "ashinzekene.nestjs"
vscode "bierner.markdown-preview-github-styles"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "Codeium.codeium"
vscode "DavidLGoldberg.jumpy2"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.quicktype-refresh"
vscode "dotenv.dotenv-vscode"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "IBM.output-colorizer"
vscode "JakeWilson.vscode-placeholder-images"
vscode "JannisX11.batch-rename-extension"
vscode "jock.svg"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nmsmith89.incrementor"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "sdras.vue-vscode-snippets"
vscode "sleistner.vscode-fileutils"
vscode "styled-components.vscode-styled-components"
vscode "techer.open-in-browser"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tonka3000.raycast"
vscode "uctakeoff.vscode-counter"
vscode "usernamehw.errorlens"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.console-ninja"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
